# Titanic: Machine Learning from Disaster

In [2]:
import matplotlib.pyplot as plt
%matplotlib inline
import random
import numpy as np
import pandas as pd
from sklearn import datasets, svm, cross_validation, tree, preprocessing, metrics
import sklearn.ensemble as ske
import tensorflow as tf

In [3]:
train_dataframe = pd.read_csv('train.csv')
test_dataframe = pd.read_csv('test.csv')

In [4]:
print('train dataframe: %s, test dataframe %s' %(str(train_dataframe.shape), str(test_dataframe.shape)) )
train_dataframe.head()

train dataframe: (891, 12), test dataframe (418, 11)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic_df = train_dataframe.dtypes.reset_index()
titanic_df.columns = ["Count", "Column Type"]
titanic_df.groupby("Column Type").aggregate('count').reset_index()

  Column Type  Count
0       int64      5
1     float64      2
2      object      5

In [7]:
titanic_df

          Count Column Type
0   PassengerId       int64
1      Survived       int64
2        Pclass       int64
3          Name      object
4           Sex      object
5           Age     float64
6         SibSp       int64
7         Parch       int64
8        Ticket      object
9          Fare     float64
10        Cabin      object
11     Embarked      object

In [17]:
# Class vs Survived
print(train_dataframe[['Pclass', 'Survived']].groupby(['Pclass'], as_index=False).mean().sort_values(by='Survived', ascending=False))

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [18]:
titanic_df.isnull().sum()

Count          0
Column Type    0
dtype: int64